# Zephyr
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion
mattmc3/zephyr path:plugins/compstyle
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/macos
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/utility

# Oh My Zsh
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/virtualenv

# Fuzzy Finder
junegunn/fzf kind:clone post:run_fzf_postinstaller

# Syntax Highlighting
zdharma-continuum/fast-syntax-highlighting kind:defer

# Completions & Suggestions
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions kind:fpath path:src

# vi: ft=config
