# Load Oh-My-Zsh Libraries but only the ones we want
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/correction.zsh
ohmyzsh/ohmyzsh path:lib/functions.zsh
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/grep.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:lib/spectrum.zsh
ohmyzsh/ohmyzsh path:lib/termsupport.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh

## General
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/git kind:fpath
ohmyzsh/ohmyzsh path:plugins/tmux kind:fpath

catppuccin/zsh-syntax-highlighting kind:fpath

## Dev Plugins
ohmyzsh/ohmyzsh path:plugins/docker kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/npm kind:fpath
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pip kind:fpath
ohmyzsh/ohmyzsh path:plugins/poetry kind:fpath
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/rust kind:fpath
ohmyzsh/ohmyzsh path:plugins/virtualenv
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath

ohmyzsh/ohmyzsh path:plugins/iterm2 conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/macports conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/macos kind:fpath conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/xcode conditional:is-macos

junegunn/fzf kind:clone post:run_fzf_postinstaller

zsh-users/zsh-completions kind:fpath path:src

zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions

# vi: ft=config
