{
  "plugins": {
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "guard-collection": {
      "src": "https://github.com/nvimdev/guard-collection"
    },
    "guard.nvim": {
      "src": "https://github.com/nvimdev/guard.nvim"
    },
    "hunk.nvim": {
      "src": "https://github.com/julienvincent/hunk.nvim"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "lush.nvim": {
      "src": "https://github.com/rktjmp/lush.nvim"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "persistence.nvim": {
      "src": "https://github.com/folke/persistence.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope-undo.nvim": {
      "src": "https://github.com/debugloop/telescope-undo.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tmux.nvim": {
      "src": "https://github.com/aserowy/tmux.nvim"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "zenbones.nvim": {
      "src": "https://github.com/zenbones-theme/zenbones.nvim"
    },
    "zig.vim": {
      "src": "https://github.com/ziglang/zig.vim"
    }
  }
}
